In [2]:
import pandas as pd

In [6]:
df = pd.read_csv('data/friend_list.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [8]:
# 몇가지 DataFrame의 기능 
# 1. head() 기본값으로 row 5개 보여줌. 만약 6개 이상이면 마지막 한개는 안보여주겠지!
df.head() 
# chris는 안보여주네
# default 값이 5임.

   name  age      job
0  John   20  student

In [9]:
# 뒤에 5개를 기준으로 해서 보여줌. 
# default = 5임.
df.tail()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [11]:
#뒤에 2개 row값만 보여줌.
df.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

### 컬럼(행)들이 Series이다.
#### 즉, 이 Seires들이 모여서 DataFrame을 구성하게 됨.

In [12]:
type(df.name)

pandas.core.series.Series

In [13]:
type(df.age)

pandas.core.series.Series

In [14]:
type(df.job)

pandas.core.series.Series

In [15]:
s1 = pd.Series([1,2,3])
s1

0    1
1    2
2    3
dtype: int64

In [17]:
s2 = pd.core.series.Series(['one','two','three'])
s2

0      one
1      two
2    three
dtype: object

In [18]:
pd.DataFrame(data=dict(num=s1,word=s2))

   num   word
0    1    one
1    2    two
2    3  three